# Lab4_2

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(
    {
        "a":[4,5,6],
        "b":[7,8,9],
        "c":[10,11,12]
    }
)

In [4]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

In [5]:
#Custom index
df = pd.DataFrame(
    {
        "a":[4,5,6],
        "b":[7,8,9],
        "c":[10,11,12]
    }, index = [10,2,23]
)

In [6]:
df

    a  b   c
10  4  7  10
2   5  8  11
23  6  9  12

In [7]:
#Accessing a slice of values
df.index

Index([10, 2, 23], dtype='int64')

In [8]:
# sort based on index
df.sort_index(ascending=False)

    a  b   c
23  6  9  12
10  4  7  10
2   5  8  11

In [9]:
df = pd.DataFrame(
    [[4,7,10],
    [5,8,11],
    [6,9,12]],
    index = [1,2,3],
    columns = ['a', 'b', 'c']
)

In [10]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

# Exercise

In [11]:
df['a'].min(), df['a'].max(), df['a'].mean()

(np.int64(4), np.int64(6), np.float64(5.0))

In [12]:
df[df['c']==11]

   a  b   c
2  5  8  11

In [13]:
df[df['c']==11]['b']

2    8
Name: b, dtype: int64

In [14]:
arr = np.arange(1,10).reshape(3,3)
df=pd.DataFrame(arr, columns=['col1', 'col2','col3'], index=[1,2,3])
df

   col1  col2  col3
1     1     2     3
2     4     5     6
3     7     8     9

In [16]:
grades = pd.DataFrame({'ML':[8,9,7,8,9,7,7,8,9], 'OS':[8,5,5,9,7,5,8,5,8], 'DS':[8,5,6,6,5,9,5,8,6], 'Java':[6,6,9,5,7,8,6,8,6]}, index=['236B101','236B102','236B103','236B104','236B105','236B106','236B107','236B108','236B109'])

In [17]:
grades

         ML  OS  DS  Java
236B101   8   8   8     6
236B102   9   5   5     6
236B103   7   5   6     9
236B104   8   9   6     5
236B105   9   7   5     7
236B106   7   5   9     8
236B107   7   8   5     6
236B108   8   5   8     8
236B109   9   8   6     6

In [26]:
#1b
grades[grades['Java']==grades['Java'].max()]

         ML  OS  DS  Java
236B103   7   5   6     9

In [27]:
#1c
grades[grades['DS']==grades['DS'].max()]

         ML  OS  DS  Java
236B106   7   5   9     8

In [28]:
#1d
grades[grades['ML']==grades['ML'].max()]

         ML  OS  DS  Java
236B102   9   5   5     6
236B105   9   7   5     7
236B109   9   8   6     6

In [37]:
#1E
grades[grades['ML']==grades['DS'].max()]['DS']

236B102    5
236B105    5
236B109    6
Name: DS, dtype: int64

# Part 3

In [39]:
# Creating a car price series with a dictinary
car_price_dict = {'Swift':700000,
                 'Jazz':800000,
                 'Civic':1600000,
                 'Altis':1800000,
                 'Gallardo':30000000}
car_price = pd.Series(car_price_dict)
# Creating the car manufacturer series with a dictionary
car_man_dict = {'Swift':'Maruti',
                 'Jazz':'Honda',
                 'Civic':'Honda',
                 'Altis':'Toyota',
                 'Gallardo':'Lamborghini'}
car_man = pd.Series(car_man_dict)
print(car_price)
print(car_man)

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
dtype: int64
Swift            Maruti
Jazz              Honda
Civic             Honda
Altis            Toyota
Gallardo    Lamborghini
dtype: object

In [40]:
# Clubbing different series togethere to create a dataframe
cars = pd.DataFrame({'Price':car_price, 'Manufacturer':car_man})
cars

             Price Manufacturer
Swift       700000       Maruti
Jazz        800000        Honda
Civic      1600000        Honda
Altis      1800000       Toyota
Gallardo  30000000  Lamborghini

In [41]:
# Accessing individual column
cars['Price']

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
Name: Price, dtype: int64

In [42]:
# Accessing individual column
cars['Manufacturer']

Swift            Maruti
Jazz              Honda
Civic             Honda
Altis            Toyota
Gallardo    Lamborghini
Name: Manufacturer, dtype: object

In [43]:
# Using dictinary to create a series
car_price_dict = {'Swift':700000,
                 'Jazz':800000,
                 'Civic':1600000,
                 'Altis':1800000,
                 'Gallardo':30000000}
car_price = pd.Series(car_price_dict)
car_price
# Creating a DataFrame from car_price Series
pd.DataFrame(car_price, columns=['Car Price'])

          Car Price
Swift        700000
Jazz         800000
Civic       1600000
Altis       1800000
Gallardo   30000000